In [1]:
import pandas as pd
series = pd.Series([10, 20, 30, 40, 50])
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [2]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [3]:
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [5]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [6]:
print(df['Name'])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [7]:
filtered_df = df[df['Age'] > 30]
print(filtered_df)

      Name  Age     City
2  Charlie   35  Chicago

In [9]:
selected_df = df.loc[0:1,['Name', 'City']]
print(selected_df)

    Name         City
0  Alice     New York
1    Bob  Los Angeles

In [10]:
df['salary'] = [100, 200, 300]
print(df)

      Name  Age         City  salary
0    Alice   25     New York     100
1      Bob   30  Los Angeles     200
2  Charlie   35      Chicago     300

In [11]:
df['Age'] = df['Age'] + 1
print(df)

      Name  Age         City  salary
0    Alice   26     New York     100
1      Bob   31  Los Angeles     200
2  Charlie   36      Chicago     300

In [12]:
df = df.drop('City', axis=1)
print(df)

      Name  Age  salary
0    Alice   26     100
1      Bob   31     200
2  Charlie   36     300

In [14]:
df_with_nan = pd.DataFrame({'A': [1, 2, None],'B': [4, None, 6]})
print(df_with_nan.isnull())

       A      B
0  False  False
1  False   True
2   True  False

In [ ]:
df_with_nan = pd.DataFrame({'A': [1, 2, None],'B': [4, None, 6]})
print(df_with_nan.isnull())

In [15]:
df_with_nan = pd.DataFrame({'A': [1, 2, None],'B': [None, None, 6]})
print(df_with_nan)

     A    B
0  1.0  NaN
1  2.0  NaN
2  NaN  6.0

In [16]:
df_with_nan.isnull()

       A      B
0  False   True
1  False   True
2   True  False

In [17]:
df_with_nan.isna()

       A      B
0  False   True
1  False   True
2   True  False

In [18]:
df_with_nan.isnull().sum()

A    1
B    2
dtype: int64

In [19]:
df_with_nan.isnull().sum().sum()

np.int64(3)

In [20]:
filled_df = df_with_nan.fillna(0)
print(filled_df)

     A    B
0  1.0  0.0
1  2.0  0.0
2  0.0  6.0

In [22]:
df_with_nan['A'] = df_with_nan['A'].fillna(df_with_nan['A'].mean())
df_with_nan

     A    B
0  1.0  NaN
1  2.0  NaN
2  1.5  6.0

In [23]:
cleaned_df = df_with_nan.dropna()
print(cleaned_df)

     A    B
2  1.5  6.0

In [28]:
def double_salary(x):
    return 2*x
df['Double Salary'] = df['salary'].apply(double_salary)
print(df)

      Name  Age  salary  Double Salary
0    Alice   26     100            200
1      Bob   31     200            400
2  Charlie   36     300            600

In [29]:
df_grades = pd.read_csv('grades_Short.csv')
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62

In [30]:
df_grades.columns

Index(['Name', 'Previous_Part', 'Participation1', 'Mini_Exam1', 'Mini_Exam2',
       'Participation2', 'Mini_Exam3', 'Final', 'Grade', 'ID'],
      dtype='object')

In [31]:
df_grades.index

RangeIndex(start=0, stop=7, step=1)

In [32]:
df_grades['Name']

0     Jake
1      Joe
2    Susan
3      Sol
4    Chris
5    Tarik
6    Malik
Name: Name, dtype: object

In [33]:
df_grades.ID

0    90743
1     7284
2     7625
3     1237
4       62
5    87452
6     9374
Name: ID, dtype: int64

In [35]:
third_name = df_grades.loc[2, 'Name']
third_name

'Susan'

In [39]:
first_row = df_grades.loc[0, :]
first_row

Name               Jake
Previous_Part      32.0
Participation1        1
Mini_Exam1         19.5
Mini_Exam2           20
Participation2        1
Mini_Exam3         10.0
Final              33.0
Grade                 A
ID                90743
Name: 0, dtype: object

In [41]:
slicing = df_grades.loc[1:3, 'Name':'Grade']
slicing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A

In [42]:
df_grades.Final.mean()

np.float64(32.214285714285715)

In [43]:
max_mini_1 = df_grades["Mini_Exam1"].max()
max_mini_1

np.float64(22.0)

In [44]:
summary_df = df_grades.describe()
summary_df[["Final","Mini_Exam2"]]

           Final  Mini_Exam2
count   7.000000    7.000000
mean   32.214286   17.857143
std     3.828154    2.734262
min    24.000000   13.000000
25%    32.500000   16.500000
50%    33.000000   19.000000
75%    33.750000   19.500000
max    36.000000   21.000000

In [51]:
counts = df_grades["Grade"].value_counts()
counts

Grade
A     5
A-    1
B     1
Name: count, dtype: int64

In [53]:
counts['A']

np.int64(5)

In [54]:
df_grades["Grade"].unique()

array(['A', 'A-', 'B'], dtype=object)

In [55]:
df_grades.shape

(7, 10)

In [56]:
df_grades.dtypes

Name               object
Previous_Part     float64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2          int64
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
ID                  int64
dtype: object

In [57]:
df_grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   Previous_Part   7 non-null      float64
 2   Participation1  7 non-null      int64
 3   Mini_Exam1      7 non-null      float64
 4   Mini_Exam2      7 non-null      int64
 5   Participation2  7 non-null      int64
 6   Mini_Exam3      7 non-null      float64
 7   Final           7 non-null      float64
 8   Grade           7 non-null      object
 9   ID              7 non-null      int64
dtypes: float64(4), int64(4), object(2)
memory usage: 692.0+ bytes

In [58]:
df_grades["final_Persentage"] = df_grades["Final"] / 36
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID,final_Persentage
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743,0.916667
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284,0.888889
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625,0.916667
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237,0.944444
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62,0.930556

In [59]:
df_grades.drop("final_Persentage", axis=1, inplace=True)
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62

In [60]:
df_missing = pd.read_csv('Missing_data.csv')
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,-1
1,Joe,NaN,1,20.0,16,1,14.0,32.0,A,23
2,Sol,31.0,1,22.0,13,1,13.0,34.0,A,34
3,Chris,30.0,-1,19.0,not available,1,12.5,33.5,A,72

In [61]:
df_missing = pd.read_csv('Missing_data.csv', na_values=['NaN',"Not avaible"])
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,-1
1,Joe,NaN,1,20.0,16,1,14.0,32.0,A,23
2,Sol,31.0,1,22.0,13,1,13.0,34.0,A,34
3,Chris,30.0,-1,19.0,not available,1,12.5,33.5,A,72

In [62]:
df_missing = pd.read_csv('Missing_data.csv', na_values={'Mini_Exam2':"Not avaible","Participation1":-1})
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20,1,10.0,33.0,A,-1
1,Joe,NaN,1.0,20.0,16,1,14.0,32.0,A,23
2,Sol,31.0,1.0,22.0,13,1,13.0,34.0,A,34
3,Chris,30.0,NaN,19.0,not available,1,12.5,33.5,A,72

In [63]:
df.isnull()

    Name    Age  salary  Double Salary
0  False  False   False          False
1  False  False   False          False
2  False  False   False          False

In [64]:
df_missing.dropna(axis=0, inplace=False)

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20,1,10.0,33.0,A,-1
2,Sol,31.0,1.0,22.0,13,1,13.0,34.0,A,34

In [65]:
df_missing.fillna(0,inplace=False)

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20,1,10.0,33.0,A,-1
1,Joe,0.0,1.0,20.0,16,1,14.0,32.0,A,23
2,Sol,31.0,1.0,22.0,13,1,13.0,34.0,A,34
3,Chris,30.0,0.0,19.0,not available,1,12.5,33.5,A,72

In [66]:
mean_temp = df_missing.Temp.mean()
df_missing.fillna({'Temp' :mean_temp},inplace=False)

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20,1,10.0,33.0,A,-1
1,Joe,NaN,1.0,20.0,16,1,14.0,32.0,A,23
2,Sol,31.0,1.0,22.0,13,1,13.0,34.0,A,34
3,Chris,30.0,NaN,19.0,not available,1,12.5,33.5,A,72